In [2]:
import pandas as pd

In [5]:
import numpy as np
pd.DataFrame(np.random.randint(2,20),
            columns=["foo","bar"],
            index=['a','b','c'])

   foo  bar
a    8    8
b    8    8
c    8    8

In [6]:
z =pd.Index([10,20,30,40,50])

In [7]:
z

Int64Index([10, 20, 30, 40, 50], dtype='int64')

In [9]:
z[1]

20

In [8]:
z[::]

Int64Index([10, 20, 30, 40, 50], dtype='int64')

In [9]:
z[::-1]

Int64Index([50, 40, 30, 20, 10], dtype='int64')

In [10]:
print(z.size,z.shape,z.ndim,z.dtype)

5 (5,) 1 int64

In [14]:
z[1]=0

TypeError: Index does not support mutable operations

In [19]:
r =np.random.RandomState(10)
r

RandomState(MT19937) at 0x1BE4A0DF840

In [26]:
s=pd.Series(r.randint(0,10,4))
s

0    9
1    1
2    9
3    4
dtype: int32

In [30]:
d=pd.DataFrame(r.randint(0,10,(10,4)),
columns = ['A','B','C','D'])
d

   A  B  C  D
0  0  1  9  0
1  9  2  1  1
2  0  0  5  9
3  0  4  6  6
4  0  2  3  3
5  2  6  0  5
6  1  3  6  5
7  5  1  8  0
8  5  9  8  5
9  7  8  5  8

In [34]:
print(s)
np.exp(s)

0    9
1    1
2    9
3    4
dtype: int32

0    8103.083928
1       2.718282
2    8103.083928
3      54.598150
dtype: float64

In [35]:
np.sin(d*np.pi/4)

          A             B             C             D
0  0.000000  7.071068e-01  7.071068e-01  0.000000e+00
1  0.707107  1.000000e+00  7.071068e-01  7.071068e-01
2  0.000000  0.000000e+00 -7.071068e-01  7.071068e-01
3  0.000000  1.224647e-16 -1.000000e+00 -1.000000e+00
4  0.000000  1.000000e+00  7.071068e-01  7.071068e-01
5  1.000000 -1.000000e+00  0.000000e+00 -7.071068e-01
6  0.707107  7.071068e-01 -1.000000e+00 -7.071068e-01
7 -0.707107  7.071068e-01 -2.449294e-16  0.000000e+00
8 -0.707107  7.071068e-01 -2.449294e-16 -7.071068e-01
9 -0.707107 -2.449294e-16 -7.071068e-01 -2.449294e-16

In [11]:
ar=pd.Series({'Jaipur':12356,'Delhi':56425,'Hydrabad':63245},name='area')
pop=pd.Series({'Bangaluru':564782345,'Delhi':58647823145,'Hydrabad':45861458990},name='population')
print(ar)
print(pop)

Jaipur      12356
Delhi       56425
Hydrabad    63245
Name: area, dtype: int64
Bangaluru      564782345
Delhi        58647823145
Hydrabad     45861458990
Name: population, dtype: int64

In [41]:
pop/ar

Bangaluru             NaN
Delhi        1.039394e+06
Hydrabad     7.251397e+05
Jaipur                NaN
dtype: float64

In [42]:
ar.index | pop.index

Index(['Bangaluru', 'Delhi', 'Hydrabad', 'Jaipur'], dtype='object')

In [43]:
a = pd.Series([2,4,6],index=[0,1,2])
b = pd.Series([1,3,5],index=[1,2,3])
print(a)
print(b)
b
a+b

0    2
1    4
2    6
dtype: int64
1    1
2    3
3    5
dtype: int64

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [44]:
a.add(b,fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [47]:
d

   A  B  C  D
0  0  1  9  0
1  9  2  1  1
2  0  0  5  9
3  0  4  6  6
4  0  2  3  3
5  2  6  0  5
6  1  3  6  5
7  5  1  8  0
8  5  9  8  5
9  7  8  5  8

In [54]:
d1=pd.DataFrame({"Province":['FL','NH','ZH'],"Population":["10000","20000","5000"],"A":[0,1,2]})
d1

  Province Population  A
0       FL      10000  0
1       NH      20000  1
2       ZH       5000  2

In [55]:
d1.merge(d)

  Province Population  A  B  C  D
0       FL      10000  0  1  9  0
1       FL      10000  0  0  5  9
2       FL      10000  0  4  6  6
3       FL      10000  0  2  3  3
4       NH      20000  1  3  6  5
5       ZH       5000  2  6  0  5

In [56]:
d.merge(d1)

   A  B  C  D Province Population
0  0  1  9  0       FL      10000
1  0  0  5  9       FL      10000
2  0  4  6  6       FL      10000
3  0  2  3  3       FL      10000
4  2  6  0  5       ZH       5000
5  1  3  6  5       NH      20000

In [59]:
d2=pd.DataFrame({"Province":["FL","NH"],"Population":["10000","20000"]})
d2
d1.merge(d2,right_on='Province',left_on='Province')

  Province Population_x  A Population_y
0       FL        10000  0        10000
1       NH        20000  1        20000

In [60]:
d3=pd.DataFrame({"Province":["FL","NH","UT"],"Population":["10000","20000","15000"]})
d1.merge(d3,how='outer')

  Province Population    A
0       FL      10000  0.0
1       NH      20000  1.0
2       ZH       5000  2.0
3       UT      15000  NaN

In [62]:
d4=pd.DataFrame({"Province":["FL","NH","FL"],"Population":["10000","20000","15000"]})
print(d1)
d1.merge(d4,how='outer')

  Province Population  A
0       FL      10000  0
1       NH      20000  1
2       ZH       5000  2

  Province Population    A
0       FL      10000  0.0
1       NH      20000  1.0
2       ZH       5000  2.0
3       FL      15000  NaN

In [64]:
serie_a=pd.Series([np.nan,2.5,np.nan,3.5,4.5,np.nan],
                 index=['f','e','d','c','b','a']) 
serie_b=pd.Series(np.arange(len(serie_a),dtype=np.float64),
                 index=['f','e','d','c','b','a'])

In [65]:
serie_a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [66]:
serie_b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [67]:
pd.Series(np.where(pd.isnull(serie_a),serie_b,serie_a),index=serie_a.index)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64

In [68]:
serie_a.combine_first(serie_b)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64